

 //طبعا قلنا اي حاجه بيز تبقى ابستراكت كلاس وده عملناه عشان نثبت اسماء الميثود بتوع اليوز كلاسز
 //عشان لو معانا ديفلوبر تانيين مايجيش يغير اسم الميثود وممكن مايظهرش انه ايرور لكن معرفش انادي ع للخبطة الاسماء
 import 'package:dartz/dartz.dart';
import 'package:movies_tv/core_%20module/error/failure.dart';

abstract class BaseUseCase <T> {
  //ودلوقتي هنشوف ايه المشترك بين اليوز كيسز كلها هنلاقي انهم فيوتشر وبتاخد ايزيار وفيلير وليست اوف موفي(الريترن)
  //هتلاقيه ف اليوز كيس بيقولك انت عامل كول بنفس كل حاجه قبلها فهتعمل اوفر رايد بعد طبعا الاكستند
  //طب انا دلوقتي هتعامل مع الموفي ديتلز ازاي هستعمل دي وهى موفي يبقى اكيد في حاجه جينريك عامه
 //يبقى هخليها تستقبل تي تايب اي نوع يعني
  Future<Either<Failure, T >> call();

 }

